Autodesk.Revit.DB.WallFoundation.SetFoundationType(Autodesk.Revit.DB.WallFoundationType)
Sets an object that represents the type of the foundation.
Remarks:
The Wall Foundation type can be used to access the multi layered structure of a foundation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.WallFoundation.GetFoundationType
Gets an object that represents the type of the foundation.
Remarks:
The Wall Foundation type can be used to access the multi layered structure of a foundation.
Since:
2016